In [1]:
import pandas as pd

In [2]:
one = pd.read_excel('one.xlsx')

In [3]:
one

  Names  values  more_values
0    aa      23    98.000000
1    bb      45    56.000000
2    cc      67    12.000000
3    dd      89   -30.666667
4    ee      12   -73.666667
5    rr      99  -116.666667
6    uu      15  -159.666667
7    ii      27  -202.666667
8    oo      45  -245.666667

In [4]:
one.columns

Index(['Names', 'values', 'more_values'], dtype='object')

In [5]:
one['values'].mean()

46.888888888888886

In [6]:
one.describe()

          values  more_values
count   9.000000     9.000000
mean   46.888889   -73.666667
std    31.821551   117.760704
min    12.000000  -245.666667
25%    23.000000  -159.666667
50%    45.000000   -73.666667
75%    67.000000    12.000000
max    99.000000    98.000000

In [7]:
#    numpy

In [8]:
import sqlite3

In [9]:
conn = sqlite3.connect('sports.db')

In [10]:
q = "SELECT * FROM players"

In [11]:
two = pd.read_sql_query(q, conn)

In [12]:
two

   id     name       sport       earn   country
0  12  federer      tennis  4050600.0     swiss
1  14    senna     foruma1   346780.0    brazil
2  16   lebron  basketball   408920.0        US
3  18    saina   badminton    28230.0     india
4  20   smriti     cricket    12054.0     india
5  22      RON    football   680234.0  portugal

In [13]:
two.to_excel('sql.xlsx', index=False)

In [20]:
pass

In [15]:
three = pd.read_csv('sample.csv')

In [16]:
three

   1       vada pav     Goli's   40
0  2  fried chicken        KFC  280
1  3        McGrill  McDonalds  150
2  4       punugulu   maharaja   25
3  5     sweet corn       home    5

In [17]:
three = pd.read_csv('sample.csv')

In [18]:
three

   Unnamed: 0           item      brand  cost
0           1       vada pav     Goli's    40
1           2  fried chicken        KFC   280
2           3        McGrill  McDonalds   150
3           4       punugulu   maharaja    25
4           5     sweet corn       home     5

In [19]:
type(one)

pandas.core.frame.DataFrame

In [25]:
three.columns[3]

'cost'

In [27]:
three.cost.min()

5

In [28]:
three['cost'].min()

5

In [29]:
three.shape

(5, 4)

In [30]:
three.head(2)

   Unnamed: 0           item   brand  cost
0           1       vada pav  Goli's    40
1           2  fried chicken     KFC   280

In [31]:
two

   id     name       sport       earn   country
0  12  federer      tennis  4050600.0     swiss
1  14    senna     foruma1   346780.0    brazil
2  16   lebron  basketball   408920.0        US
3  18    saina   badminton    28230.0     india
4  20   smriti     cricket    12054.0     india
5  22      RON    football   680234.0  portugal

In [32]:
two.country.unique()

array(['swiss', 'brazil', 'US', 'india', 'portugal'], dtype=object)

In [35]:
dicta = {'company':['amazon', 'apple', 'google', 'facebook','microsoft'], 'CEO':['Jeff', 'Tim', 'Sundar', 'Mark', 'Satya'], 'founded': [1994, 1976, 1997, 2004, 1975]}

In [36]:
dicta

{'company': ['amazon', 'apple', 'google', 'facebook', 'microsoft'],
 'CEO': ['Jeff', 'Tim', 'Sundar', 'Mark', 'Satya'],
 'founded': [1994, 1976, 1997, 2004, 1975]}

In [37]:
four = pd.DataFrame(dicta)

In [38]:
four

     company     CEO  founded
0     amazon    Jeff     1994
1      apple     Tim     1976
2     google  Sundar     1997
3   facebook    Mark     2004
4  microsoft   Satya     1975

In [39]:
four.index

RangeIndex(start=0, stop=5, step=1)

In [40]:
four.index = ['alexa', 'siri', 'assitant', 'jarvis', 'cortana']

In [41]:
four

            company     CEO  founded
alexa        amazon    Jeff     1994
siri          apple     Tim     1976
assitant     google  Sundar     1997
jarvis     facebook    Mark     2004
cortana   microsoft   Satya     1975

In [42]:
four['company']

alexa          amazon
siri            apple
assitant       google
jarvis       facebook
cortana     microsoft
Name: company, dtype: object

In [43]:
four[['company']]

            company
alexa        amazon
siri          apple
assitant     google
jarvis     facebook
cortana   microsoft

In [44]:
four[['company', 'founded']]

            company  founded
alexa        amazon     1994
siri          apple     1976
assitant     google     1997
jarvis     facebook     2004
cortana   microsoft     1975

In [45]:
four[0:3]

         company     CEO  founded
alexa     amazon    Jeff     1994
siri       apple     Tim     1976
assitant  google  Sundar     1997

In [46]:
four[-3:-1]

           company     CEO  founded
assitant    google  Sundar     1997
jarvis    facebook    Mark     2004

In [48]:
four[four['founded']<1995]

           company    CEO  founded
alexa       amazon   Jeff     1994
siri         apple    Tim     1976
cortana  microsoft  Satya     1975

In [49]:
two.set_index('sport')

            id     name       earn   country
sport
tennis      12  federer  4050600.0     swiss
foruma1     14    senna   346780.0    brazil
basketball  16   lebron   408920.0        US
badminton   18    saina    28230.0     india
cricket     20   smriti    12054.0     india
football    22      RON   680234.0  portugal

In [50]:
two

   id     name       sport       earn   country
0  12  federer      tennis  4050600.0     swiss
1  14    senna     foruma1   346780.0    brazil
2  16   lebron  basketball   408920.0        US
3  18    saina   badminton    28230.0     india
4  20   smriti     cricket    12054.0     india
5  22      RON    football   680234.0  portugal

In [51]:
two.set_index('sport', inplace=True)

In [52]:
two

            id     name       earn   country
sport
tennis      12  federer  4050600.0     swiss
foruma1     14    senna   346780.0    brazil
basketball  16   lebron   408920.0        US
badminton   18    saina    28230.0     india
cricket     20   smriti    12054.0     india
football    22      RON   680234.0  portugal

In [53]:
two.reset_index(inplace=True)

In [54]:
two

        sport  id     name       earn   country
0      tennis  12  federer  4050600.0     swiss
1     foruma1  14    senna   346780.0    brazil
2  basketball  16   lebron   408920.0        US
3   badminton  18    saina    28230.0     india
4     cricket  20   smriti    12054.0     india
5    football  22      RON   680234.0  portugal

In [55]:
four

            company     CEO  founded
alexa        amazon    Jeff     1994
siri          apple     Tim     1976
assitant     google  Sundar     1997
jarvis     facebook    Mark     2004
cortana   microsoft   Satya     1975

In [56]:
three

   Unnamed: 0           item      brand  cost
0           1       vada pav     Goli's    40
1           2  fried chicken        KFC   280
2           3        McGrill  McDonalds   150
3           4       punugulu   maharaja    25
4           5     sweet corn       home     5

In [57]:
three.sort_values('cost', ascending=True)

   Unnamed: 0           item      brand  cost
4           5     sweet corn       home     5
3           4       punugulu   maharaja    25
0           1       vada pav     Goli's    40
2           3        McGrill  McDonalds   150
1           2  fried chicken        KFC   280

In [58]:
three.rename(columns={'item':'snack'}, inplace=True)

In [59]:
three

   Unnamed: 0          snack      brand  cost
0           1       vada pav     Goli's    40
1           2  fried chicken        KFC   280
2           3        McGrill  McDonalds   150
3           4       punugulu   maharaja    25
4           5     sweet corn       home     5

In [62]:
three.rename(columns={'Unnamed: 0':'num'}, inplace=True)

In [63]:
three

   num          snack      brand  cost
0    1       vada pav     Goli's    40
1    2  fried chicken        KFC   280
2    3        McGrill  McDonalds   150
3    4       punugulu   maharaja    25
4    5     sweet corn       home     5

In [64]:
three['total cost'] = three.eval('cost+(cost*(0.05))')

In [65]:
three

   num          snack      brand  cost  total cost
0    1       vada pav     Goli's    40       42.00
1    2  fried chicken        KFC   280      294.00
2    3        McGrill  McDonalds   150      157.50
3    4       punugulu   maharaja    25       26.25
4    5     sweet corn       home     5        5.25

In [67]:
three['total cost']

0     42.00
1    294.00
2    157.50
3     26.25
4      5.25
Name: total cost, dtype: float64

In [68]:
three

   num          snack      brand  cost  total cost
0    1       vada pav     Goli's    40       42.00
1    2  fried chicken        KFC   280      294.00
2    3        McGrill  McDonalds   150      157.50
3    4       punugulu   maharaja    25       26.25
4    5     sweet corn       home     5        5.25

In [69]:
three['total cost'].max()

294.0

In [70]:
five = pd.read_csv('food.csv')

In [71]:
five

   Unnamed: 0         item   cost
0           1        salad   40.0
1           2      biryani  120.0
2           3       burger   38.0
3           4       bhajia   20.0
4           5  bitter corn    NaN
5           6     parantha   40.0

In [72]:
five.isnull()

   Unnamed: 0   item   cost
0       False  False  False
1       False  False  False
2       False  False  False
3       False  False  False
4       False  False   True
5       False  False  False

In [74]:
five.isnull().sum()

Unnamed: 0    0
item          0
cost          1
dtype: int64

In [75]:
four

            company     CEO  founded
alexa        amazon    Jeff     1994
siri          apple     Tim     1976
assitant     google  Sundar     1997
jarvis     facebook    Mark     2004
cortana   microsoft   Satya     1975

In [76]:
three

   num          snack      brand  cost  total cost
0    1       vada pav     Goli's    40       42.00
1    2  fried chicken        KFC   280      294.00
2    3        McGrill  McDonalds   150      157.50
3    4       punugulu   maharaja    25       26.25
4    5     sweet corn       home     5        5.25

In [77]:
five

   Unnamed: 0         item   cost
0           1        salad   40.0
1           2      biryani  120.0
2           3       burger   38.0
3           4       bhajia   20.0
4           5  bitter corn    NaN
5           6     parantha   40.0

In [78]:
five.rename(columns={'Unnamed: 0':'num'}, inplace=True)

In [79]:
three

   num          snack      brand  cost  total cost
0    1       vada pav     Goli's    40       42.00
1    2  fried chicken        KFC   280      294.00
2    3        McGrill  McDonalds   150      157.50
3    4       punugulu   maharaja    25       26.25
4    5     sweet corn       home     5        5.25

In [80]:
five

   num         item   cost
0    1        salad   40.0
1    2      biryani  120.0
2    3       burger   38.0
3    4       bhajia   20.0
4    5  bitter corn    NaN
5    6     parantha   40.0

In [81]:
pd.concat([three, five])

C:\Users\admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

       brand   cost         item  num          snack  total cost
0     Goli's   40.0          NaN    1       vada pav       42.00
1        KFC  280.0          NaN    2  fried chicken      294.00
2  McDonalds  150.0          NaN    3        McGrill      157.50
3   maharaja   25.0          NaN    4       punugulu       26.25
4       home    5.0          NaN    5     sweet corn        5.25
0        NaN   40.0        salad    1            NaN         NaN
1        NaN  120.0      biryani    2            NaN         NaN
2        NaN   38.0       burger    3            NaN         NaN
3        NaN   20.0       bhajia    4            NaN         NaN
4        NaN    NaN  bitter corn    5            NaN         NaN
5        NaN   40.0     parantha    6            NaN         NaN

In [82]:
six = pd.concat([three, five])

C:\Users\admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [83]:
six

       brand   cost         item  num          snack  total cost
0     Goli's   40.0          NaN    1       vada pav       42.00
1        KFC  280.0          NaN    2  fried chicken      294.00
2  McDonalds  150.0          NaN    3        McGrill      157.50
3   maharaja   25.0          NaN    4       punugulu       26.25
4       home    5.0          NaN    5     sweet corn        5.25
0        NaN   40.0        salad    1            NaN         NaN
1        NaN  120.0      biryani    2            NaN         NaN
2        NaN   38.0       burger    3            NaN         NaN
3        NaN   20.0       bhajia    4            NaN         NaN
4        NaN    NaN  bitter corn    5            NaN         NaN
5        NaN   40.0     parantha    6            NaN         NaN

In [84]:
six.to_excel('combine.xlsx', index=False)